# Pandas Indexing Cheatsheet
This notebook has the code that corresponds to the items in the Pandas Indexing Cheatsheet pdf.

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'company': ['Widgets, Inc.', 'ABC, LLC', 'ACME'],
                   'city': ['Jay City', 'Wanton', 'Bland'],
                   'state': ['MO', 'TX', 'AL'],
                   'zip': ['46239', '94562', '32329']},
                  index=list("abc"))

In [3]:
s = df['city']

## Array Indexing Operator (```[]```)

In [4]:
# DataFrame
df['company'] # Series, entire column

a    Widgets, Inc.
b         ABC, LLC
c             ACME
Name: company, dtype: object

In [5]:
df[['company']] # DataFrame, with one column

         company
a  Widgets, Inc.
b       ABC, LLC
c           ACME

In [6]:
df[['company', 'city']] # DataFrame, multiple columns

         company      city
a  Widgets, Inc.  Jay City
b       ABC, LLC    Wanton
c           ACME     Bland

In [7]:
# Series
s[0] # scalar, selecting by location

'Jay City'

In [8]:
s['a'] # scalar, selecting by index label

'Jay City'

## ```loc``` Indexer, selecting by index label

In [9]:
# DataFrame
df.loc['a'] # Series, first row matching index label

company    Widgets, Inc.
city            Jay City
state                 MO
zip                46239
Name: a, dtype: object

In [10]:
df.loc[['a', 'c']] # DataFrame, selecting by multiple labels

         company      city state    zip
a  Widgets, Inc.  Jay City    MO  46239
c           ACME     Bland    AL  32329

In [11]:
df.loc['a', 'city'] # scalar, selecting by row and column label

'Jay City'

In [12]:
df.loc[['a', 'c'], 'city'] # Series, selecting by labels and columns

a    Jay City
c       Bland
Name: city, dtype: object

In [13]:
df.loc[['a', 'c'], ['city', 'zip']] # DataFrame, selecting by labels and columns

       city    zip
a  Jay City  46239
c     Bland  32329

In [14]:
# Series
s.loc['a'] # scalar, selecting by index label

'Jay City'

In [15]:
s.loc[['a', 'c']] # Series, selecting by multiple labels

a    Jay City
c       Bland
Name: city, dtype: object

In [16]:
s.loc[['a']] # Series, selecting by a single label

a    Jay City
Name: city, dtype: object

## iloc Indexer - selecting by row and column offset

In [17]:
# DataFrame
df.iloc[0] # Series, first row by row location

company    Widgets, Inc.
city            Jay City
state                 MO
zip                46239
Name: a, dtype: object

In [18]:
df.iloc[[0,2]] # DataFrame, selecting by multiple rows by location

         company      city state    zip
a  Widgets, Inc.  Jay City    MO  46239
c           ACME     Bland    AL  32329

In [19]:
df.iloc[0,1] # scalar, selecting by row and column offset

'Jay City'

In [20]:
df.iloc[[0,2], 1] # Series, selecting by rows and a single column

a    Jay City
c       Bland
Name: city, dtype: object

In [21]:
df.iloc[[0,2], [1,3]] # DataFrame, selecting by rows and columns

       city    zip
a  Jay City  46239
c     Bland  32329

In [22]:
# Series
s.iloc[0] # scalar, selecting by offset

'Jay City'

In [23]:
s.iloc[-1] # scalar, selecting by relative offset

'Bland'

In [24]:
s.iloc[[0,2]] # Series, selecting by multiple offsets

a    Jay City
c       Bland
Name: city, dtype: object

In [25]:
s.iloc[[0]] # Series, selecting by a single offset

a    Jay City
Name: city, dtype: object

## Slicing

In [26]:
# DataFrame
df[0:2] # DataFrame, slice by row location (doesn't include end)

         company      city state    zip
a  Widgets, Inc.  Jay City    MO  46239
b       ABC, LLC    Wanton    TX  94562

In [27]:
df.loc['a':'c'] # DataFrame, slice by label (note rows selected, inclusive of end)

         company      city state    zip
a  Widgets, Inc.  Jay City    MO  46239
b       ABC, LLC    Wanton    TX  94562
c           ACME     Bland    AL  32329

In [28]:
df.iloc[0:2] # DataFrame, slice by row location (doesn't include end)

         company      city state    zip
a  Widgets, Inc.  Jay City    MO  46239
b       ABC, LLC    Wanton    TX  94562

In [29]:
df.loc['a':'c', 'city':'zip'] # DataFrame, slice both rows and columns (inclusive for both)

       city state    zip
a  Jay City    MO  46239
b    Wanton    TX  94562
c     Bland    AL  32329

In [30]:
df.iloc[0:3, 1:4] # DataFrame, slice by both rows and columns (doesn't include end)

       city state    zip
a  Jay City    MO  46239
b    Wanton    TX  94562
c     Bland    AL  32329

In [31]:
#Series
s[:]  # full slice

a    Jay City
b      Wanton
c       Bland
Name: city, dtype: object

In [32]:
print(s[:2]) # all ways to slice first two elements in Series
print(s[0:2])
print(s[0:2:1])
print(s[slice(0,2,1)])

a    Jay City
b      Wanton
Name: city, dtype: object
a    Jay City
b      Wanton
Name: city, dtype: object
a    Jay City
b      Wanton
Name: city, dtype: object
a    Jay City
b      Wanton
Name: city, dtype: object

In [33]:
s['b':'c'] # slice by label, inclusive

b    Wanton
c     Bland
Name: city, dtype: object

In [34]:
s.loc['b':'d'] # slice by label, inclusive

b    Wanton
c     Bland
Name: city, dtype: object

In [35]:
s.iloc[1:3] # slice by location, not inclusive

b    Wanton
c     Bland
Name: city, dtype: object